In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("us_tornado_dataset_1950_2021.csv")

In [4]:
df.columns = df.columns.str.strip().str.lower()

In [5]:
print(df.columns)

Index(['yr', 'mo', 'dy', 'date', 'st', 'mag', 'inj', 'fat', 'slat', 'slon',
       'elat', 'elon', 'len', 'wid'],
      dtype='object')

In [6]:
df['mag'] = df['mag'].replace(-9, 'Unrated')

In [7]:
def map_scale(val):
    if val == 'Unrated':
        return 'Unrated'
    try:
        return f'F/EF{int(val)}'
    except:
        return 'Unrated'

df['f_scale'] = df['mag'].apply(map_scale)

In [8]:
print(df['f_scale'].value_counts())

f_scale
F/EF0      31375
F/EF1      22885
F/EF2       9517
F/EF3       2536
Unrated      605
F/EF4        581
F/EF5         59
Name: count, dtype: int64

In [10]:
month_map = {
    1: 'Jan', 2: 'Feb', 3: 'Mar', 4: 'Apr',
    5: 'May', 6: 'Jun', 7: 'Jul', 8: 'Aug',
    9: 'Sep', 10: 'Oct', 11: 'Nov', 12: 'Dec'
}

df['month_name'] = df['mo'].map(month_map)

In [11]:
print(df[['mo', 'month_name']].head(12))

    mo month_name
0    1        Jan
1    1        Jan
2    1        Jan
3    1        Jan
4    1        Jan
5    1        Jan
6    1        Jan
7    2        Feb
8    2        Feb
9    2        Feb
10   2        Feb
11   2        Feb

In [12]:
df_rename = df.rename(columns={'yr': 'year', 'mo': 'month', 'dy': 'day'})

In [14]:
df['full_date'] = pd.to_datetime(df_rename[['year', 'month', 'day']], errors='coerce')

In [17]:
df[['yr', 'mo', 'dy', 'full_date']].head(10)

     yr  mo  dy  full_date
0  1950   1   3 1950-01-03
1  1950   1   3 1950-01-03
2  1950   1   3 1950-01-03
3  1950   1  13 1950-01-13
4  1950   1  25 1950-01-25
5  1950   1  25 1950-01-25
6  1950   1  26 1950-01-26
7  1950   2  11 1950-02-11
8  1950   2  11 1950-02-11
9  1950   2  11 1950-02-11

In [18]:
columns_to_keep = [
    'full_date', 'yr', 'mo', 'month_name', 'dy',
    'st', 'f_scale', 'inj', 'fat', 'len', 'wid'
]
df_cleaned = df[columns_to_keep]

In [19]:
df_cleaned.head()

   full_date    yr  mo month_name  dy  st f_scale  inj  fat  len  wid
0 1950-01-03  1950   1        Jan   3  IL   F/EF3    3    0  3.6  130
1 1950-01-03  1950   1        Jan   3  MO   F/EF3    3    0  9.5  150
2 1950-01-03  1950   1        Jan   3  OH   F/EF1    1    0  0.1   10
3 1950-01-13  1950   1        Jan  13  AR   F/EF3    1    1  0.6   17
4 1950-01-25  1950   1        Jan  25  IL   F/EF2    0    0  0.1  100

In [20]:
df_cleaned.to_csv("tornado_cleaned_for_dashboard.csv", index=False)